pmo-dataset/variations/graphviz_with_ids/01.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Record order in\nsystem"];
  "Task_2" [label="Collect customer\ninformation"];
  "Task_3" [label="Guide customer in\nselecting\nproduct/service"];
  "Task_4" [label="Provide quote"];
  "Task_5" [label="Receive customer\ninquiry"];
  "Task_6" [label="Place order"];
  "Task_7" [label="Address customer\nconcerns or\nquestions"];
  "Task_8" [label="Send order\nconfirmation to\ncustomer"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "Task_8" -> "ExclusiveGateway_1";
  "ExclusiveGateway_3" -> "EndNoneEvent_1";
  "ParallelGateway_2" -> "Task_7";
  "Task_1" -> "Task_8";
  "Task_7" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "Task_2" -> "ParallelGateway_1";
  "StartNoneEvent_1" -> "Task_5";
  "ParallelGateway_2" -> "Task_2";
  "ExclusiveGateway_4" -> "ExclusiveGateway_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Task_6" -> "Task_1";
  "ExclusiveGateway_4" -> "Task_3";
  "Task_4" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Task_6";
  "Task_5" -> "ParallelGateway_2";
  "Task_3" -> "Task_4";
}
