pmo-dataset/variations/mermaid_basic/01.mmd
graph LR
	Task_8["Send order confirmation to customer"] --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_3{"X"} --> EndEvent_1(("end"))
	ParallelGateway_2{"+"} --> Task_7["Address customer concerns or questions"]
	Task_1["Record order in system"] --> Task_8
	Task_7 --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_1 --> ExclusiveGateway_3
	Task_2["Collect customer information"] --> ParallelGateway_1
	StartEvent_1(("start")) --> Task_5["Receive customer inquiry"]
	ParallelGateway_2 --> Task_2
	ExclusiveGateway_4 --> ExclusiveGateway_3
	ExclusiveGateway_2{"X"} --> ExclusiveGateway_1
	Task_6["Place order"] --> Task_1
	ExclusiveGateway_4 --> Task_3["Guide customer in selecting product/service"]
	Task_4["Provide quote"] --> ExclusiveGateway_2
	ExclusiveGateway_2 --> Task_6
	Task_5 --> ParallelGateway_2
	Task_3 --> Task_4
